* Overtone for simple sequences processing
#+begin_src clojure
(use 'overtone.live)
#+end_src

#+begin_src clojure
(def w31 '(1/1 64/63 28/27     16/15   12/11    9/8       8/7       7/6       6/5       27/22     5/4     80/63     35/27     4/3         256/189   112/81    64/45     16/11     3/2         32/21     14/9      8/5     18/11     27/16     12/7      7/4       9/5       81/44    15/8    40/21    35/18  2/1))

(def w31-f (for [n w31] (float n)))

(def w31-A440 (for [n w31-f] (* n 440)))
#+end_src

#+RESULTS:
: Please reevaluate when nREPL is connected

